coocox/Mplib/Toshaba/TMPM33x/TMPM330/cmsis_lib/lib/cmsis_boot/TMPM330.h
/**
 *******************************************************************************
 * @file    TMPM330.h
 * @brief   CMSIS Cortex-M3 Core Peripheral Access Layer Header File for the 
 *          TOSHIBA 'TMPM330' Device Series 
 * @version V2.1.0
 * @date    2010/07/20
 * 
 * THE SOURCE CODE AND ITS RELATED DOCUMENTATION IS PROVIDED "AS IS". TOSHIBA
 * CORPORATION MAKES NO OTHER WARRANTY OF ANY KIND, WHETHER EXPRESS, IMPLIED OR,
 * STATUTORY AND DISCLAIMS ANY AND ALL IMPLIED WARRANTIES OF MERCHANTABILITY,
 * SATISFACTORY QUALITY, NON INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE.
 * 
 * THE SOURCE CODE AND DOCUMENTATION MAY INCLUDE ERRORS. TOSHIBA CORPORATION
 * RESERVES THE RIGHT TO INCORPORATE MODIFICATIONS TO THE SOURCE CODE IN LATER
 * REVISIONS OF IT, AND TO MAKE IMPROVEMENTS OR CHANGES IN THE DOCUMENTATION OR
 * THE PRODUCTS OR TECHNOLOGIES DESCRIBED THEREIN AT ANY TIME.
 * 
 * TOSHIBA CORPORATION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
 * CONSEQUENTIAL DAMAGE OR LIABILITY ARISING FROM YOUR USE OF THE SOURCE CODE OR
 * ANY DOCUMENTATION, INCLUDING BUT NOT LIMITED TO, LOST REVENUES, DATA OR
 * PROFITS, DAMAGES OF ANY SPECIAL, INCIDENTAL OR CONSEQUENTIAL NATURE, PUNITIVE
 * DAMAGES, LOSS OF PROPERTY OR LOSS OF PROFITS ARISING OUT OF OR IN CONNECTION
 * WITH THIS AGREEMENT, OR BEING UNUSABLE, EVEN IF ADVISED OF THE POSSIBILITY OR
 * PROBABILITY OF SUCH DAMAGES AND WHETHER A CLAIM FOR SUCH DAMAGE IS BASED UPON
 * WARRANTY, CONTRACT, TORT, NEGLIGENCE OR OTHERWISE.
 * 
 * (C)Copyright TOSHIBA CORPORATION 2010 All rights reserved
 *******************************************************************************
 */

/** @addtogroup TOSHIBA_TX03_MICROCONTROLLER
  * @{
  */

/** @addtogroup TMPM330
  * @{
  */

#ifndef __TMPM330_H__
#define __TMPM330_H__

#ifdef __cplusplus
extern "C" {
#endif 

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/** Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M3 Processor Exceptions Numbers ****************************************************/
  NonMaskableInt_IRQn           = -14,      /*!< 2 Non Maskable Interrupt                          */
  HardFault_IRQn                = -13,      /*!< 3 Cortex-M3 Hard Fault Interrupt                  */
  MemoryManagement_IRQn         = -12,      /*!< 4 Cortex-M3 Memory Management Interrupt           */
  BusFault_IRQn                 = -11,      /*!< 5 Cortex-M3 Bus Fault Interrupt                   */
  UsageFault_IRQn               = -10,      /*!< 6 Cortex-M3 Usage Fault Interrupt                 */
  SVCall_IRQn                   = -5,       /*!< 11 Cortex-M3 SV Call Interrupt                    */
  DebugMonitor_IRQn             = -4,       /*!< 12 Cortex-M3 Debug Monitor Interrupt              */
  PendSV_IRQn                   = -2,       /*!< 14 Cortex-M3 Pend SV Interrupt                    */
  SysTick_IRQn                  = -1,       /*!< 15 Cortex-M3 System Tick Interrupt                */

/******  TMPM330 Specific Interrupt Numbers ********************************************************/
  INT0_IRQn                     = 0,        /*!< Interrupt pin (PJ0/70 pin)                        */
  INT1_IRQn                     = 1,        /*!< Interrupt pin (PJ1/49 pin)                        */
  INT2_IRQn                     = 2,        /*!< Interrupt pin (PJ2/86 pin)                        */
  INT3_IRQn                     = 3,        /*!< Interrupt pin (PJ3/87 pin)                        */
  INT4_IRQn                     = 4,        /*!< Interrupt pin (PG3/6  pin)                        */
  INT5_IRQn                     = 5,        /*!< Interrupt pin (PF7/19 pin)                        */
  INTRX0_IRQn                   = 6,        /*!< Serial reception (channel.0)                      */
  INTTX0_IRQn                   = 7,        /*!< Serial transmission (channel.0)                   */
  INTRX1_IRQn                   = 8,        /*!< Serial reception (channel.1)                      */
  INTTX1_IRQn                   = 9,        /*!< Serial transmission (channel.1)                   */
  INTSBI0_IRQn                  = 10,       /*!< Serial bus interface 0                            */
  INTSBI1_IRQn                  = 11,       /*!< Serial bus interface 1                            */
  INTCECRX_IRQn                 = 12,       /*!< CEC reception                                     */
  INTCECTX_IRQn                 = 13,       /*!< CEC transmission                                  */
  INTRMCRX0_IRQn                = 14,       /*!< Remote control signal reception (channel.0)       */
  INTADHP_IRQn                  = 15,       /*!< Highest priority AD conversion complete interrupt */
  INTADM0_IRQn                  = 16,       /*!< AD conversion monitoring function interrupt 0     */
  INTADM1_IRQn                  = 17,       /*!< AD conversion monitoring function interrupt 1     */
  INTTB0_IRQn                   = 18,       /*!< 16-bit TMRB match detection 0                     */
  INTTB1_IRQn                   = 19,       /*!< 16-bit TMRB match detection 1                     */
  INTTB2_IRQn                   = 20,       /*!< 16-bit TMRB match detection 2                     */
  INTTB3_IRQn                   = 21,       /*!< 16-bit TMRB match detection 3                     */
  INTTB4_IRQn                   = 22,       /*!< 16-bit TMRB match detection 4                     */
  INTTB5_IRQn                   = 23,       /*!< 16-bit TMRB match detection 5                     */
  INTTB6_IRQn                   = 24,       /*!< 16-bit TMRB match detection 6                     */
  INTRTC_IRQn                   = 25,       /*!< Real time clock timer                             */
  INTCAP00_IRQn                 = 26,       /*!< 16-bit TMRB input capture 00                      */
  INTCAP01_IRQn                 = 27,       /*!< 16-bit TMRB input capture 01                      */
  INTCAP10_IRQn                 = 28,       /*!< 16-bit TMRB input capture 10                      */
  INTCAP11_IRQn                 = 29,       /*!< 16-bit TMRB input capture 11                      */
  INTCAP50_IRQn                 = 30,       /*!< 16-bit TMRB input capture 50                      */
  INTCAP51_IRQn                 = 31,       /*!< 16-bit TMRB input capture 51                      */
  INTCAP60_IRQn                 = 32,       /*!< 16-bit TMRB input capture 60                      */
  INTCAP61_IRQn                 = 33,       /*!< 16-bit TMRB input capture 61                      */
  INT6_IRQn                     = 34,       /*!< Interrupt pin (PJ6/39 pin)                        */
  INT7_IRQn                     = 35,       /*!< Interrupt pin (PJ7/58 pin)                        */
  INTRX2_IRQn                   = 36,       /*!< Serial reception (channel.2)                      */
  INTTX2_IRQn                   = 37,       /*!< Serial transmission (channel.2)                   */
  INTSBI2_IRQn                  = 38,       /*!< Serial bus interface 2                            */
  INTRMCRX1_IRQn                = 39,       /*!< Remote control signal reception (channel.1)       */
  INTTB7_IRQn                   = 40,       /*!< 16-bit TMRB match detection 7                     */
  INTTB8_IRQn                   = 41,       /*!< 16-bit TMRB match detection 8                     */
  INTTB9_IRQn                   = 42,       /*!< 16-bit TMRB match detection 9                     */
  INTCAP20_IRQn                 = 43,       /*!< 16-bit TMRB input capture 20                      */
  INTCAP21_IRQn                 = 44,       /*!< 16-bit TMRB input capture 21                      */
  INTCAP30_IRQn                 = 45,       /*!< 16-bit TMRB input capture 30                      */
  INTCAP31_IRQn                 = 46,       /*!< 16-bit TMRB input capture 31                      */
  INTCAP40_IRQn                 = 47,       /*!< 16-bit TMRB input capture 40                      */
  INTCAP41_IRQn                 = 48,       /*!< 16-bit TMRB input capture 41                      */
  INTAD_IRQn                    = 49        /*!< A/D conversion completion                         */
} IRQn_Type;


